# 1. Використовуючи функцію print, надрукувати фразу “I love Python” 42 рази.

text = "I love Python "

text *= 42

print(text)

# 2. Створити змінну age_in_month, надавши їй значення вашого поточного віку в місяцях.

age_in_months = 28 * 12
print(age_in_months)

# 3. Створити змінну age_in_years, в яку записати ваш вік в роках на основі
# попередньої змінної. Підказка:використовуючи арифметичні оператори та/або
# приведення типів).

age_in_years = age_in_months // 12
print(age_in_years)

# 4. Створити змінну my_age, яка буде містити рядок “Му name is … I’m … years old”, де на замість
# пропусків буде підставлятись ваші імʼя та вік. Значення віку слід брати зі змінної age_in_years.

my_age = "Му name is Kate. I’m " + str(age_in_years) + " years old"
print(my_age)

# 5. Створити змінну зі значенням 1. Використовуючи оператори порівняння, порівняти
# її із будь-якими іншими значеннями (мінімум 5 порівнянь) і перевірити вивід в інтерпретаторі.

a = 1

print(a == 2)
print(a == 0)
print(a == 1)
print(a == a)

print(a != 1)
print(a != 5)

print(a > 1)
print(a > 0)

print(a >= 1)

print(a < 5)

print(a <= 2)

# 6. Створити змінні a=2, b=5, c=6. На основі цих змінних створити змінну d, значення якої має бути “256”

a = 2
b = 5
c = 6

d = str(a) + str(b) + str(c)

print(d)
